xiguaakako/ArtSense-Proximity-Aware-Exhibition-Experience/ARTSENSE-STM32/BlueNRG_MS/App/app_bluenrg_ms.c
/**
  ******************************************************************************
  * @file    app_bluenrg_ms.c
  * @author  SRA Application Team
  * @brief   BlueNRG-M0 initialization and applicative code
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "app_bluenrg_ms.h"

#include "hci.h"
#include "hci_le.h"
#include "hci_tl.h"
#include "link_layer.h"
#include "sensor.h"
#include "gatt_db.h"

#include "compiler.h"
#include "bluenrg_utils.h"
#include "b_l475e_iot01a2.h"
#include "bluenrg_gap.h"
#include "bluenrg_gap_aci.h"
#include "bluenrg_gatt_aci.h"
#include "bluenrg_hal_aci.h"
#include "sm.h"
#include "stm32l4xx_hal_tim.h"

/* USER CODE BEGIN Includes */
#include "lsm6dsl.h"
#include "global.h"
/* USER CODE END Includes */

/* Private defines -----------------------------------------------------------*/
/**
 * 1 to send environmental and motion data when pushing the user button
 * 0 to send environmental and motion data automatically (period = 1 sec)
 */
#define USE_BUTTON 0

/* Private macros ------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
extern AxesRaw_t x_axes;
extern AxesRaw_t g_axes;
extern AxesRaw_t m_axes;
extern AxesRaw_t q_axes;
extern volatile uint8_t want_update;
extern volatile uint8_t set_connectable;
extern volatile int     connected;
/* at startup, suppose the X-NUCLEO-IDB04A1 is used */
uint8_t bnrg_expansion_board = IDB04A1;
uint8_t bdaddr[BDADDR_SIZE];
static volatile uint8_t user_button_init_state = 1;
static volatile uint8_t user_button_pressed = 0;

/* USER CODE BEGIN PV */
extern __IO uint16_t connection_handle;
extern uint16_t EnvironmentalCharHandle;
extern LSM6DSL_Axes_t acc_axes;

char device_name[18];
uint8_t acc_sensitivity;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void User_Process(void);
//void UPP(void);
static void User_Init(void);
//static void Set_Random_Environmental_Values(float *data_t, float *data_p);
//static void Set_Random_Motion_Values(uint32_t cnt);
//static void Reset_Motion_Values(void);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

#if PRINT_CSV_FORMAT
extern volatile uint32_t ms_counter;
/**
 * @brief  This function is a utility to print the log time
 *         in the format HH:MM:SS:MSS (DK GUI time format)
 * @param  None
 * @retval None
 */
void print_csv_time(void){
  uint32_t ms = HAL_GetTick();
  PRINT_CSV("%02ld:%02ld:%02ld.%03ld", (long)(ms/(60*60*1000)%24), (long)(ms/(60*1000)%60), (long)((ms/1000)%60), (long)(ms%1000));
}
#endif

void MX_BlueNRG_MS_Init(void)
{
  /* USER CODE BEGIN SV */

  /* USER CODE END SV */

  /* USER CODE BEGIN BlueNRG_MS_Init_PreTreatment */

  /* USER CODE END BlueNRG_MS_Init_PreTreatment */

  /* Initialize the peripherals and the BLE Stack */
  const char *name = "BlueNRG";
  uint16_t service_handle, dev_name_char_handle, appearance_char_handle;

  uint8_t  bdaddr_len_out;
  uint8_t  hwVersion;
  uint16_t fwVersion;
  int ret;

  User_Init();

  /* Get the User Button initial state */
  user_button_init_state = BSP_PB_GetState(BUTTON_KEY);

  hci_init(user_notify, NULL);

  /* get the BlueNRG HW and FW versions */
  getBlueNRGVersion(&hwVersion, &fwVersion);

  /*
   * Reset BlueNRG again otherwise we won't
   * be able to change its MAC address.
   * aci_hal_write_config_data() must be the first
   * command after reset otherwise it will fail.
   */
  hci_reset();
  HAL_Delay(100);

  PRINTF("HWver %d\r\nFWver %d\r\n", hwVersion, fwVersion);
  if (hwVersion > 0x30) { /* X-NUCLEO-IDB05A1 expansion board is used */
    bnrg_expansion_board = IDB05A1;
  }

  ret = aci_hal_read_config_data(CONFIG_DATA_RANDOM_ADDRESS, BDADDR_SIZE, &bdaddr_len_out, bdaddr);

  if (ret) {
    PRINTF("Read Static Random address failed.\r\n");
  }

  if ((bdaddr[5] & 0xC0) != 0xC0) {
    PRINTF("Static Random address not well formed.\r\n");
    while(1);
  }

  /* GATT Init */
  ret = aci_gatt_init();
  if(ret){
    PRINTF("GATT_Init failed.\r\n");
  }

  /* GAP Init */
  if (bnrg_expansion_board == IDB05A1) {
    ret = aci_gap_init_IDB05A1(GAP_PERIPHERAL_ROLE_IDB05A1, 0, 0x07, &service_handle, &dev_name_char_handle, &appearance_char_handle);
  }
  else {
    ret = aci_gap_init_IDB04A1(GAP_PERIPHERAL_ROLE_IDB04A1, &service_handle, &dev_name_char_handle, &appearance_char_handle);
  }
  if (ret != BLE_STATUS_SUCCESS) {
    PRINTF("GAP_Init failed.\r\n");
  }

  /* Update device name */
  ret = aci_gatt_update_char_value(service_handle, dev_name_char_handle, 0,
                                   strlen(name), (uint8_t *)name);
  if (ret) {
    PRINTF("aci_gatt_update_char_value failed.\r\n");
    while(1);
  }

  ret = aci_gap_set_auth_requirement(MITM_PROTECTION_REQUIRED,
                                     OOB_AUTH_DATA_ABSENT,
                                     NULL,
                                     7,
                                     16,
                                     USE_FIXED_PIN_FOR_PAIRING,
                                     123456,
                                     BONDING);
  if (ret) {
    PRINTF("aci_gap_set_authentication_requirement failed.\r\n");
    while(1);
  }

  PRINTF("BLE Stack Initialized\r\n");

  ret = Add_HWServW2ST_Service();
  if(ret == BLE_STATUS_SUCCESS) {
    PRINTF("BlueMS HW service added successfully.\r\n");
  } else {
    PRINTF("Error while adding BlueMS HW service: 0x%02x\r\n", ret);
    while(1);
  }

  /*---initialize global vairables---*/
	const char *source = DEVICE_NAME;

	// Use a for loop to copy each character
	for (int i = 0; i < 17; i++) {
		device_name[i] = source[i];
	}
	device_name[17] = '\0'; // Add the null terminator at the end
	acc_sensitivity = SENSITIVITY;


	 /*---initialize global vairables---*/
//  ret = Add_SWServW2ST_Service();
//  if(ret == BLE_STATUS_SUCCESS) {
//     PRINTF("BlueMS SW service added successfully.\r\n");
//  } else {
//     PRINTF("Error while adding BlueMS HW service: 0x%02x\r\n", ret);
//     while(1);
//  }

  /* Set output power level */
  ret = aci_hal_set_tx_power_level(1,4);

  /* USER CODE BEGIN BlueNRG_MS_Init_PostTreatment */

  /* USER CODE END BlueNRG_MS_Init_PostTreatment */
}

/*
 * BlueNRG-MS background task
 */
void MX_BlueNRG_MS_Process(void)
{
  /* USER CODE BEGIN BlueNRG_MS_Process_PreTreatment */

  /* USER CODE END BlueNRG_MS_Process_PreTreatment */

  User_Process();
  hci_user_evt_proc();

  /* USER CODE BEGIN BlueNRG_MS_Process_PostTreatment */

  /* USER CODE END BlueNRG_MS_Process_PostTreatment */
}

/**
 * @brief  Initialize User process.
 *
 * @param  None
 * @retval None
 */
static void User_Init(void)
{
  BSP_PB_Init(BUTTON_KEY, BUTTON_MODE_EXTI);
  BSP_LED_Init(LED2);

  BSP_COM_Init(COM1);
}

/**
 * @brief  Process user input (i.e. pressing the USER button on Nucleo board)
 *         and send the updated acceleration data to the remote client.
 *
 * @param  None
 * @retval None
 */
static void User_Process(void)
{
//  float data_t;
//  float data_p;
//  static uint32_t counter = 0;

  if (set_connectable)
  {
    Set_DeviceConnectable();
    set_connectable = FALSE;
  }

#if USE_BUTTON
  /* Check if the user has pushed the button */
  if (user_button_pressed)
  {
    /* Debouncing */
    HAL_Delay(50);

    /* Wait until the User Button is released */
    while (BSP_PB_GetState(BUTTON_KEY) == !user_button_init_state);

    /* Debouncing */
    HAL_Delay(50);
#endif
    BSP_LED_Toggle(LED2);

    if (connected)
    {
      /* Set a random seed */
      srand(HAL_GetTick());

      /* Update emulated Environmental data */
//      Set_Random_Environmental_Values(&data_t, &data_p);
//      BlueMS_Environmental_Update((int32_t)(data_p *100), (int16_t)(data_t * 10));
//      tBleStatus ret = aci_gatt_read_charac_val(connection_handle, EnvironmentalCharHandle);
//      if (ret != BLE_STATUS_SUCCESS){
//    	  PRINTF("Error while reading TEMP characteristic: 0x%04X\n", ret) ;
////	  	  return BLE_STATUS_ERROR ;
//      } else {
//    	  PRINTF("I'm happy.\r\n");
//      }

      /* Update emulated Acceleration, Gyroscope and Sensor Fusion data */
//      Set_Random_Motion_Values(counter);
      x_axes.AXIS_X  = acc_axes.x;
      x_axes.AXIS_Y  = acc_axes.y;
      x_axes.AXIS_Z  = acc_axes.z;
      if(want_update){
		  Acc_Update(&x_axes, &g_axes, &m_axes);
		  PRINTF("ACC UPDATE SUCCESS!! it's %d, %d, %d\r\n", (int)x_axes.AXIS_X, (int)x_axes.AXIS_Y, (int)x_axes.AXIS_Z);
		  //Quat_Update(&q_axes);
		  want_update = 0;
      }

//      counter ++;
//      if (counter == 40) {
//        counter = 0;
//        Reset_Motion_Values();
//      }
#if !USE_BUTTON
      HAL_Delay(10); /* wait 1 sec before sending new data */
#endif
    }
#if USE_BUTTON
    /* Reset the User Button flag */
    user_button_pressed = 0;
  }
#endif
}

//void UPP(void)
//{
//  float data_t;
//  float data_p;
//  static uint32_t counter = 0;
//
////  if (set_connectable)
////  {
////    Set_DeviceConnectable();
////    set_connectable = FALSE;
////  }
//
//#if USE_BUTTON
//  /* Check if the user has pushed the button */
//  if (user_button_pressed)
//  {
//    /* Debouncing */
//    HAL_Delay(50);
//
//    /* Wait until the User Button is released */
//    while (BSP_PB_GetState(BUTTON_KEY) == !user_button_init_state);
//
//    /* Debouncing */
//    HAL_Delay(50);
//#endif
////    BSP_LED_Toggle(LED2);
//
//    if (connected)
//    {
//      /* Set a random seed */
//      srand(HAL_GetTick());
//
//      /* Update emulated Environmental data */
////      Set_Random_Environmental_Values(&data_t, &data_p);
////      BlueMS_Environmental_Update((int32_t)(data_p *100), (int16_t)(data_t * 10));
////      tBleStatus ret = aci_gatt_read_charac_val(connection_handle, EnvironmentalCharHandle);
////      if (ret != BLE_STATUS_SUCCESS){
////    	  PRINTF("Error while reading TEMP characteristic: 0x%04X\n", ret) ;
//////	  	  return BLE_STATUS_ERROR ;
////      } else {
////    	  PRINTF("I'm happy.\r\n");
////      }
//
//      /* Update emulated Acceleration, Gyroscope and Sensor Fusion data */
////      Set_Random_Motion_Values(counter);
////      x_axes.AXIS_X  = acc_axes.x;
////      x_axes.AXIS_Y  = acc_axes.y;
////      x_axes.AXIS_Z  = acc_axes.z;
////      Acc_Update(&x_axes, &g_axes, &m_axes);
////      PRINTF("ACC UPDATE SUCCESS!! it's %d, %d, %d", x_axes.AXIS_X, x_axes.AXIS_Y, x_axes.AXIS_Z);
////      Quat_Update(&q_axes);
//
////      counter ++;
////      if (counter == 40) {
////        counter = 0;
////        Reset_Motion_Values();
////      }
//#if !USE_BUTTON
//      HAL_Delay(10); /* wait 1 sec before sending new data */
//#endif
//    }
//#if USE_BUTTON
//    /* Reset the User Button flag */
//    user_button_pressed = 0;
//  }
//#endif
//}
//
///**
// * @brief  Set random values for all environmental sensor data
// * @param  float pointer to temperature data
// * @param  float pointer to pressure data
// * @retval None
// */
//static void Set_Random_Environmental_Values(float *data_t, float *data_p)
//{
//  *data_t = 27.0 + ((uint64_t)rand()*5)/RAND_MAX;     /* T sensor emulation */
//  *data_p = 1000.0 + ((uint64_t)rand()*80)/RAND_MAX; /* P sensor emulation */
//}

/**
 * @brief  Set random values for all motion sensor data
 * @param  uint32_t counter for changing the rotation direction
 * @retval None
 */
//static void Set_Random_Motion_Values(uint32_t cnt)
//{
//  /* Update Acceleration, Gyroscope and Sensor Fusion data */
//  if (cnt < 20) {
//    x_axes.AXIS_X +=  (10  + ((uint64_t)rand()*3*cnt)/RAND_MAX);
//    x_axes.AXIS_Y += -(10  + ((uint64_t)rand()*5*cnt)/RAND_MAX);
//    x_axes.AXIS_Z +=  (10  + ((uint64_t)rand()*7*cnt)/RAND_MAX);
//    g_axes.AXIS_X +=  (100 + ((uint64_t)rand()*2*cnt)/RAND_MAX);
//    g_axes.AXIS_Y += -(100 + ((uint64_t)rand()*4*cnt)/RAND_MAX);
//    g_axes.AXIS_Z +=  (100 + ((uint64_t)rand()*6*cnt)/RAND_MAX);
//    m_axes.AXIS_X +=  (3  + ((uint64_t)rand()*3*cnt)/RAND_MAX);
//    m_axes.AXIS_Y += -(3  + ((uint64_t)rand()*4*cnt)/RAND_MAX);
//    m_axes.AXIS_Z +=  (3  + ((uint64_t)rand()*5*cnt)/RAND_MAX);
//
//    q_axes.AXIS_X -= (100  + ((uint64_t)rand()*3*cnt)/RAND_MAX);
//    q_axes.AXIS_Y += (100  + ((uint64_t)rand()*5*cnt)/RAND_MAX);
//    q_axes.AXIS_Z -= (100  + ((uint64_t)rand()*7*cnt)/RAND_MAX);
//  }
//  else {
//    x_axes.AXIS_X += -(10  + ((uint64_t)rand()*3*cnt)/RAND_MAX);
//    x_axes.AXIS_Y +=  (10  + ((uint64_t)rand()*5*cnt)/RAND_MAX);
//    x_axes.AXIS_Z += -(10  + ((uint64_t)rand()*7*cnt)/RAND_MAX);
//    g_axes.AXIS_X += -(100 + ((uint64_t)rand()*2*cnt)/RAND_MAX);
//    g_axes.AXIS_Y +=  (100 + ((uint64_t)rand()*4*cnt)/RAND_MAX);
//    g_axes.AXIS_Z += -(100 + ((uint64_t)rand()*6*cnt)/RAND_MAX);
//    m_axes.AXIS_X += -(3  + ((uint64_t)rand()*7*cnt)/RAND_MAX);
//    m_axes.AXIS_Y +=  (3  + ((uint64_t)rand()*9*cnt)/RAND_MAX);
//    m_axes.AXIS_Z += -(3  + ((uint64_t)rand()*3*cnt)/RAND_MAX);
//
//    q_axes.AXIS_X += (200 + ((uint64_t)rand()*7*cnt)/RAND_MAX);
//    q_axes.AXIS_Y -= (150 + ((uint64_t)rand()*3*cnt)/RAND_MAX);
//    q_axes.AXIS_Z += (10  + ((uint64_t)rand()*5*cnt)/RAND_MAX);
//  }
//
//}
//
///**
// * @brief  Reset values for all motion sensor data
// * @param  None
// * @retval None
// */
//static void Reset_Motion_Values(void)
//{
//  x_axes.AXIS_X = (x_axes.AXIS_X)%2000 == 0 ? -x_axes.AXIS_X : 10;
//  x_axes.AXIS_Y = (x_axes.AXIS_Y)%2000 == 0 ? -x_axes.AXIS_Y : -10;
//  x_axes.AXIS_Z = (x_axes.AXIS_Z)%2000 == 0 ? -x_axes.AXIS_Z : 10;
//  g_axes.AXIS_X = (g_axes.AXIS_X)%2000 == 0 ? -g_axes.AXIS_X : 100;
//  g_axes.AXIS_Y = (g_axes.AXIS_Y)%2000 == 0 ? -g_axes.AXIS_Y : -100;
//  g_axes.AXIS_Z = (g_axes.AXIS_Z)%2000 == 0 ? -g_axes.AXIS_Z : 100;
//  m_axes.AXIS_X = (g_axes.AXIS_X)%2000 == 0 ? -m_axes.AXIS_X : 3;
//  m_axes.AXIS_Y = (g_axes.AXIS_Y)%2000 == 0 ? -m_axes.AXIS_Y : -3;
//  m_axes.AXIS_Z = (g_axes.AXIS_Z)%2000 == 0 ? -m_axes.AXIS_Z : 3;
//  q_axes.AXIS_X = -q_axes.AXIS_X;
//  q_axes.AXIS_Y = -q_axes.AXIS_Y;
//  q_axes.AXIS_Z = -q_axes.AXIS_Z;
//}

/**
  * @brief  BSP Push Button callback
  * @param  Button Specifies the pin connected EXTI line
  * @retval None.
  */
void BSP_PB_Callback(Button_TypeDef Button)
{
  /* Set the User Button flag */
  user_button_pressed = 1;
}
